furkanapp/app/controllers/api/categories_controller.rb

    def index
      @categories = Category.order(created_at: :desc)

      if !@categories.blank?
---
SELECT "categories".* FROM "categories" ORDER BY "categories"."created_at" DESC

    def create
      @category = Category.create(params_category)
      if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Telefon"], ["created_at", "2022-10-16 22:28:00.022412"], ["updated_at", "2022-10-16 22:28:00.022412"]]
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Telefon"], ["created_at", "2022-11-01 11:44:01.917282"], ["updated_at", "2022-11-01 11:44:01.917282"]]

    def update
      if @category.update(params_category)
---
UPDATE "categories" SET "name" = $1, "updated_at" = $2 WHERE "categories"."id" = $3  [["name", "Bilgisayarr"], ["updated_at", "2022-10-16 20:04:36.780272"], ["id", 2]]

    def destroy
      if @category.destroy
---
DELETE FROM "categories" WHERE "categories"."id" = $1  [["id", 2]]