furkanapp/app/controllers/api/products_controller.rb

SELECT "products".* FROM "products"
---
    def index   # ismi "mobile" olan tüm ürünleri, sondan başa doğru listeler
      @products = Product.all

INSERT INTO "products" ("name", "description", "quantity", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "telefon"], ["description", "harika bir telefon"], ["quantity", 50], ["price", 4500.0], ["created_at", "2022-10-16 17:05:33.879227"], ["updated_at", "2022-10-16 17:05:33.879227"]]
UPDATE "products" SET "updated_at" = $1 WHERE "products"."id" = $2  [["updated_at", "2022-10-16 21:53:21.179750"], ["id", 1]]
---
    def create  # Yeni bir ürün oluşturmamızı sağlar.
      @product = Product.create(product_params)
      @product.save

UPDATE "products" SET "name" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["name", "iphone 13 pro max"], ["updated_at", "2022-10-16 17:19:25.904115"], ["id", 1]]
---
    def update  # Ürünlerin çeşitli parametrelerini güncellememizi sağlar.
      @product.update(product_params)

DELETE FROM "products" WHERE "products"."id" = $1  [["id", 1]]
---
    def destroy # İstediğimiz ürünleri silme işlemini gerçekleştirir.
      @product.destroy

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_product # ID değerini gerekli fonksiyonlar için kullanılabilir hale getirir.
      @product = Product.find(params[:id])